Revit 2026 API

# IFCDataGetSimpleType Method

---

Gets the IFC type name.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetSimpleType()
```
```vb
Public Function GetSimpleType As String
```
```cpp
public:
String^ GetSimpleType()
```
```fsharp
member GetSimpleType : unit -> string
```

#### Return Value

String The name.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | No type assigned or it is not a simple type. |

#### Reference

IFCData Class

Autodesk.Revit.DB.IFC Namespace